teaching/411-fall-25/411-fall-25.org
#+TITLE: Math 411 - Fall 2025
#+SUBTITLE: Introduction to Abstract Algebra 1
#+AUTHOR: Santiago Arango-Piñeros
#+EMAIL: sarangopiner@umass.edu
#+OPTIONS: toc:t num:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../../org-css.css"/>
#+HTML_HEAD:  <link rel="shortcut icon" type="image/x-icon" href="../../images/umass-favicon.ico">

* Coordinates
** Instructor
[[https://sarangop1728.github.io/][Santiago Arango-Piñeros]] (he/him/his).

My office is in *LGRT 1238*, and you can contact me via email at:
+ ~sarangopiner@umass.edu~.

** Teaching Assistant
Yuting Zhang
+ ~yutingzhang@umass.edu~

** Grader
Aaron Tian
+ ~atian@umass.edu~

** Lectures
|----------------+-------+---------------------+----------|
| /              | <     | <                   | <        |
| Section        | Days  | Time                | Place    |
|----------------+-------+---------------------+----------|
| 01-LEC (64725) | Tu, Th | 8:30 AM - 9:45 AM   | LGRT 177 |
| 02-LEC (64726) | Tu, Th | 10:00 AM - 11:15 AM | LGRT 206 |
|----------------+-------+---------------------+----------|

** Office hours
Feel free to drop by our office hours to ask questions or talk about the class.

|--------+-------------------+-----------|
| /      | <                 | <         |
| Days   | Time              | Place     |
|--------+-------------------+-----------|
| Tu     | 1:00 PM - 3:30 PM | LGRT 1522 |
| Wed, Fr | 1:30 PM - 3:30 PM | LGRT 1526 |
|--------+-------------------+-----------|

If the times above are not convenient, or if you would like to discuss a
private matter, send me an email.
  
* Course description
The focus of the course will be on studying /groups/. These are algebraic
structures that capture the notion of symmetry. Groups are ubiquitous in all
areas of mathematics (and the world around us). If you commit to this class,
you will master the essential concepts of group theory by the end of the
course.
** Prerequisites
*MATH 235* and either *CMPSCI 250* or *MATH 300*. In other words, we will need
some important concepts from linear algebra, and there will be an emphasis on
proofs and development of careful mathematical reasoning and writing.

** Textbook
+ */Algebra: Abstract and Concrete/* by Frederick M. Goodman. The book is
  freely available for download at the [[https://homepage.divms.uiowa.edu/~goodman/algebrabook.dir/algebrabook.html][author's website]].
+ As a complement of the textbook, we will use some of [[https://kconrad.math.uconn.edu/blurbs/][Keith Conrad's blurbs]] on
  group theory.

** Learning objectives

1. To learn the fundamental examples of groups: finitely generated abelian
   groups, dihedral groups, symmetric and alternating groups, and matrix
   groups.
2. To learn the axiomatic definition of a group and how to use it to prove
   basic properties.
3. To learn the concepts of subgroups, cosets, quotients, and how to combine
   these to derive Lagrange’s theorem.
4. To learn the concepts of homomorphisms and isomorphisms and Noether's
   isomorphism theorems.
5. To understand the structure theorem of finitely generated abelian groups in
   terms of the Smith normal form of a matrix with integer coefficients.
6. To learn what it means for a group to act on a set as well as the
   natural actions of each of the fundamental examples.

