teaching/411-fall-25/411-fall-25.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-16 Tue 08:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Math 411 - Fall 2025</title>
<meta name="author" content="Santiago Arango-Piñeros" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../org-css.css"/>
<link rel="shortcut icon" type="image/x-icon" href="../../images/umass-favicon.ico">

</head>
<body>
<div id="content" class="content">
<h1 class="title">Math 411 - Fall 2025
<br />
<span class="subtitle">Introduction to Abstract Algebra 1</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1bc4882">Coordinates</a>
<ul>
<li><a href="#org2ee60ee">Instructor</a></li>
<li><a href="#orgae3db37">Teaching Assistant</a></li>
<li><a href="#orgd23ee92">Grader</a></li>
<li><a href="#org44ff53c">Lectures</a></li>
<li><a href="#org8343301">Office hours</a></li>
</ul>
</li>
<li><a href="#orgf2ae056">Course description</a>
<ul>
<li><a href="#org8cf94dd">Prerequisites</a></li>
<li><a href="#org1d52591">Textbook</a></li>
<li><a href="#org219ca39">Learning objectives</a></li>
<li><a href="#orgd4caf5e">Homework (<code>300 points</code>)</a></li>
<li><a href="#org8af2129">Exams (<code>300 points</code>)</a></li>
<li><a href="#orge1b1f97">``Mistakes were made'' essay (<code>100 points</code>)</a></li>
<li><a href="#orgf16ab12">Final exam (<code>300 points</code>)</a></li>
<li><a href="#orgfa02e48">Grades</a></li>
</ul>
</li>
<li><a href="#org7dcee22">Topics and schedule</a></li>
<li><a href="#orga4876dc">Philosophy</a>
<ul>
<li><a href="#orgb087619">Adopt a growth mindset</a></li>
<li><a href="#org3570d4c">Learning is the student's responsibility</a></li>
<li><a href="#org2183785">Doing hard things</a></li>
<li><a href="#org6beea2a">Everyone belongs in this classroom</a></li>
</ul>
</li>
<li><a href="#org4b06956">Administrative details</a>
<ul>
<li><a href="#org4053da6">Drops, withdrawals, and incompletes</a></li>
<li><a href="#orgff336b8">Make-up exam policy</a></li>
<li><a href="#orgbf26865">Class attendance policy</a></li>
<li><a href="#org8ee18d8">Class etiquette</a></li>
<li><a href="#org6e4d589">Academic dishonesty</a></li>
</ul>
</li>
<li><a href="#org764f2e9">Required statements</a>
<ul>
<li><a href="#org1827532">Academic honesty statement</a></li>
<li><a href="#org097d4e1">Academic integrity statement</a></li>
<li><a href="#orgd33c204">Accommodation statement</a></li>
<li><a href="#orgc74e168">Title IX statement</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org1bc4882" class="outline-2">
<h2 id="org1bc4882">Coordinates</h2>
<div class="outline-text-2" id="text-org1bc4882">
</div>
<div id="outline-container-org2ee60ee" class="outline-3">
<h3 id="org2ee60ee">Instructor</h3>
<div class="outline-text-3" id="text-org2ee60ee">
<p>
<a href="https://sarangop1728.github.io/">Santiago Arango-Piñeros</a> (he/him/his).
</p>

<p>
My office is in <b>LGRT 1238</b>, and you can contact me via email at:
</p>
<ul class="org-ul">
<li><code>sarangopiner@umass.edu</code>.</li>
</ul>
</div>
</div>

<div id="outline-container-orgae3db37" class="outline-3">
<h3 id="orgae3db37">Teaching Assistant</h3>
<div class="outline-text-3" id="text-orgae3db37">
<p>
Yuting Zhang
</p>
<ul class="org-ul">
<li><code>yutingzhang@umass.edu</code></li>
</ul>
</div>
</div>

<div id="outline-container-orgd23ee92" class="outline-3">
<h3 id="orgd23ee92">Grader</h3>
<div class="outline-text-3" id="text-orgd23ee92">
<p>
Aaron Tian
</p>
<ul class="org-ul">
<li><code>atian@umass.edu</code></li>
</ul>
</div>
</div>

<div id="outline-container-org44ff53c" class="outline-3">
<h3 id="org44ff53c">Lectures</h3>
<div class="outline-text-3" id="text-org44ff53c">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Section</th>
<th scope="col" class="org-left">Days</th>
<th scope="col" class="org-left">Time</th>
<th scope="col" class="org-left">Place</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">01-LEC (64725)</td>
<td class="org-left">Tu, Th</td>
<td class="org-left">8:30 AM - 9:45 AM</td>
<td class="org-left">LGRT 177</td>
</tr>

<tr>
<td class="org-left">02-LEC (64726)</td>
<td class="org-left">Tu, Th</td>
<td class="org-left">10:00 AM - 11:15 AM</td>
<td class="org-left">LGRT 206</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org8343301" class="outline-3">
<h3 id="org8343301">Office hours</h3>
<div class="outline-text-3" id="text-org8343301">
<p>
Feel free to drop by our office hours to ask questions or talk about the class.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Days</th>
<th scope="col" class="org-left">Time</th>
<th scope="col" class="org-left">Place</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Tu</td>
<td class="org-left">1:00 PM - 3:30 PM</td>
<td class="org-left">LGRT 1522</td>
</tr>

<tr>
<td class="org-left">Wed, Fr</td>
<td class="org-left">1:30 PM - 3:30 PM</td>
<td class="org-left">LGRT 1526</td>
</tr>
</tbody>
</table>

<p>
If the times above are not convenient, or if you would like to discuss a
private matter, send me an email.
</p>
</div>
</div>
</div>

<div id="outline-container-orgf2ae056" class="outline-2">
<h2 id="orgf2ae056">Course description</h2>
<div class="outline-text-2" id="text-orgf2ae056">
<p>
The focus of the course will be on studying <i>groups</i>. These are algebraic
structures that capture the notion of symmetry. Groups are ubiquitous in all
areas of mathematics (and the world around us). If you commit to this class,
you will master the essential concepts of group theory by the end of the
course.
</p>
</div>
<div id="outline-container-org8cf94dd" class="outline-3">
<h3 id="org8cf94dd">Prerequisites</h3>
<div class="outline-text-3" id="text-org8cf94dd">
<p>
<b>MATH 235</b> and either <b>CMPSCI 250</b> or <b>MATH 300</b>. In other words, we will need
some important concepts from linear algebra, and there will be an emphasis on
proofs and development of careful mathematical reasoning and writing.
</p>
</div>
</div>

<div id="outline-container-org1d52591" class="outline-3">
<h3 id="org1d52591">Textbook</h3>
<div class="outline-text-3" id="text-org1d52591">
<ul class="org-ul">
<li><b><i>Algebra: Abstract and Concrete</i></b> by Frederick M. Goodman. The book is
freely available for download at the <a href="https://homepage.divms.uiowa.edu/~goodman/algebrabook.dir/algebrabook.html">author's website</a>.</li>
<li>As a complement of the textbook, we will use some of <a href="https://kconrad.math.uconn.edu/blurbs/">Keith Conrad's blurbs</a> on
group theory.</li>
</ul>
</div>
</div>

<div id="outline-container-org219ca39" class="outline-3">
<h3 id="org219ca39">Learning objectives</h3>
<div class="outline-text-3" id="text-org219ca39">
<ol class="org-ol">
<li>To learn the fundamental examples of groups: finitely generated abelian
groups, dihedral groups, symmetric and alternating groups, and matrix
groups.</li>
<li>To learn the axiomatic definition of a group and how to use it to prove
basic properties.</li>
<li>To learn the concepts of subgroups, cosets, quotients, and how to combine
these to derive Lagrange’s theorem.</li>
<li>To learn the concepts of homomorphisms and isomorphisms and Noether's
isomorphism theorems.</li>
<li>To understand the structure theorem of finitely generated abelian groups in
terms of the Smith normal form of a matrix with integer coefficients.</li>
<li>To learn what it means for a group to act on a set as well as the
natural actions of each of the fundamental examples.</li>
</ol>
</div>
</div>
