teaching/411-fall-25/411-fall-25.org
** Homework (~300 points~)
Homework assignments must be submitted through Gradescope by ~11:59 PM~ on the
due date. Each problem set contains 5 problems, and each problem is worth ~10
points~. This means that there is a ~50 points~ bonus on the homework. *Late
homework will not be graded.*

Collaboration with other students is highly encouraged! Nevertheless, every
student must write down their own solutions.

The use of professional academic typing software, such as [[https://typst.app/][Typst]] or
[[https://www.latex-project.org/][LaTeX]] (for example, via a free account at [[https://www.overleaf.com][Overleaf]]), is highly recommended
but not required. However, if the grader finds the writing difficult to read,
they reserve the right not to grade that particular answer.

+ ~PSET1~: Some examples of groups ([[https://www.dropbox.com/scl/fi/b5i8ayu0mxpzt1sbj5l27/pset1.pdf?rlkey=o3916firn5vuidmhinecvd0ho&dl=0][~pdf~]])([[https://www.dropbox.com/scl/fi/0uub9l5u6pso216iesn1o/pset1.tex?rlkey=cc1g4p7ltbzmbpzx6nofferut&dl=0][~tex~]])([[https://www.dropbox.com/scl/fi/tk00ud7mduyy1zio5baix/pset1-sol.pdf?rlkey=7a0c70e0lifhmiz1zot4e54ef&dl=0][~solution~]]) <2025-09-13 Sat 23:59>.
+ ~PSET2~: Basic properties of groups ([[https://www.dropbox.com/scl/fi/l7nq6825mdd7g55jijv24/pset2.pdf?rlkey=dl6i8wy7metiw6m0myawpsq9b&dl=0][~pdf~]])([[https://www.dropbox.com/scl/fi/9pbho8nj3yjmbprpnz5pj/pset2.tex?rlkey=ssvvl8vv68bml2qvbn2bv43ve&dl=0][~tex~]])([[https://www.dropbox.com/scl/fi/w8gnepiciawc0u15tot9o/pset2-sol.pdf?rlkey=oyc8uhdop12k3z8gnmcpm5ach&dl=0][~solution~]]) <2025-09-30 Tue 23:59>.
+ ~PSET3~: Cosets and Lagrange's theorem ([[https://www.dropbox.com/scl/fi/6pcxfv9io7z6kwu4apih3/pset3.pdf?rlkey=fmnd6uq9wkjuj71gml2th5uci&dl=0][~pdf~]])([[https://www.dropbox.com/scl/fi/osekgzpbd5bnvgmqi78rk/pset3.tex?rlkey=cutmmdo3iger3k7rpdo5gyv5o&dl=0][~tex~]])([[https://www.dropbox.com/scl/fi/ckmq30wut1053i5znaxkq/pset3-sol.pdf?rlkey=ptov92gbrgq5sdg5ol8519sg7&dl=0][~solution~]]) <2025-10-14 Tue 23:59>. 
+ ~PSET4~: The isomorphism theorems ([[https://www.dropbox.com/scl/fi/9atils9ndqw21s3l7587o/pset4.pdf?rlkey=cv7um1y5hsaglv7flr62bbk6h&dl=0][~pdf~]])([[https://www.dropbox.com/scl/fi/nxv95mjncgqwkenhqqn2p/pset4.tex?rlkey=a20rit6emx9y17rzyql4xqx4p&dl=0][~tex~]]) <2025-10-28 Tue 23:59>.
+ ~PSET5~: Finitely generated abelian groups (~pdf~)(~tex~) <2025-11-11 Tue 23:59>.
+ ~PSET6~: Symmetries of regular polyhedra (~pdf~)(~tex~)  <2025-11-25 Tue 23:59>.
+ ~PSET7~: Group actions (~pdf~)(~tex~) <2025-12-11 Thu 23:59>.

** Exams (~300 points~)
There will be three midterm exams. Each exam will have 5 questions. Each question will
be worth ~20 points~.
+ ~EXAM1~: Lectures 1-7. ([[https://www.dropbox.com/scl/fi/bmsjqie8nzscj5b07s4ai/exam1v1-solution.pdf?rlkey=v8d697jjlb8mlwwdts8n79lnb&dl=0][solution]]) <2025-09-25 Thu>
+ ~EXAM2~: Lectures 8-14. <2025-11-06 Thu>
+ ~EXAM3~: Lectures 18-22. <2025-12-09 Tue>
Question one will ask you to define a concept. Question two will ask you to
prove a result (of reasonable difficulty) from the assigned reading. Questions
3, 4, and 5 will be random problems related to the topics of the lectures.
** ``Mistakes were made'' essay (~100 points~)
This is a *handwritten* essay, due on the day of the final exam. It must
include at least:
+ three _mathematical_ mistakes you (the *student*) made during the course
  (either in a homework assignment, a previous test, or during self-study), and
+ two mathematical mistakes your favorite AI made when prompted with some group
  theory question;

along with thorough explanations of the nature of the errors and their
corrections. The essay will be graded on the mathematical accuracy of each
explanation: an accurate description of each mistake, together with a complete
correction, will be worth ~20 points~.

** Final exam (~300 points~)
The final exam will consist on six random problems related to the topics of the
lectures. Each problem will be worth ~50 points~. The emphasis will be on the
topics of lectures 1-14 and 18-22. 

** Grades
The perfect final grade is ~1000 points~. The alphabetical grade of the class
will be calculated as follows:
+ ~Homework grade = min(300, PSET1 + ... + PSET7)~.
+ ~Exams grade = EXAM1 + EXAM2 + EXAM3 + ESSAY + FINAL~
+ ~Final grade = Homework grade + Exams grade~.

| *Grade*  | A            | A$-$        | B$+$        | B           | B$-$        |
|----------+--------------+-------------+-------------+-------------+-------------|
| /        | <            |             |             |             |             |
| ~points~ | $[860,1000]$ | $[830,860)$ | $[780,830)$ | $[740,780)$ | $[690,740)$ |


| *Grade*  | C$+$        | C           | C$-$        | D$+$        | D           | F         |
|----------+-------------+-------------+-------------+-------------+-------------+-----------|
| /        | <           |             |             |             |             |           |
| ~points~ | $[650,690)$ | $[610,650)$ | $[560,610)$ | $[520,560)$ | $[480,520)$ | $[0,480)$ |

