teaching/411-fall-25/411-fall-25.html

<div id="outline-container-orgd4caf5e" class="outline-3">
<h3 id="orgd4caf5e">Homework (<code>300 points</code>)</h3>
<div class="outline-text-3" id="text-orgd4caf5e">
<p>
Homework assignments must be submitted through Gradescope by <code>11:59 PM</code> on the
due date. Each problem set contains 5 problems, and each problem is worth <code>10
points</code>. This means that there is a <code>50 points</code> bonus on the homework. <b>Late
homework will not be graded.</b>
</p>

<p>
Collaboration with other students is highly encouraged! Nevertheless, every
student must write down their own solutions.
</p>

<p>
The use of professional academic typing software, such as <a href="https://typst.app/">Typst</a> or
<a href="https://www.latex-project.org/">LaTeX</a> (for example, via a free account at <a href="https://www.overleaf.com">Overleaf</a>), is highly recommended
but not required. However, if the grader finds the writing difficult to read,
they reserve the right not to grade that particular answer.
</p>

<ul class="org-ul">
<li><code>PSET1</code>: Some examples of groups (<a href="https://www.dropbox.com/scl/fi/b5i8ayu0mxpzt1sbj5l27/pset1.pdf?rlkey=o3916firn5vuidmhinecvd0ho&amp;dl=0"><code>pdf</code></a>)(<a href="https://www.dropbox.com/scl/fi/0uub9l5u6pso216iesn1o/pset1.tex?rlkey=cc1g4p7ltbzmbpzx6nofferut&amp;dl=0"><code>tex</code></a>) <span class="timestamp-wrapper"><span class="timestamp">&lt;2025-09-13 Sat 23:59&gt;</span></span>.</li>
<li><code>PSET2</code>: Basic properties of groups
(<a href="https://www.dropbox.com/scl/fi/l7nq6825mdd7g55jijv24/pset2.pdf?rlkey=dl6i8wy7metiw6m0myawpsq9b&amp;dl=0"><code>pdf</code></a>)(<a href="https://www.dropbox.com/scl/fi/9pbho8nj3yjmbprpnz5pj/pset2.tex?rlkey=ssvvl8vv68bml2qvbn2bv43ve&amp;dl=0"><code>tex</code></a>) <span class="timestamp-wrapper"><span class="timestamp">&lt;2025-09-25 Thu 23:59&gt;</span></span>.</li>
<li><code>PSET3</code>: Lagrange's theorem (<code>pdf</code>)(<code>tex</code>) <span class="timestamp-wrapper"><span class="timestamp">&lt;2025-10-07 Tue 23:59&gt;</span></span>.</li>
<li><code>PSET4</code>: The isomorphism theorems (<code>pdf</code>)(<code>tex</code>) <span class="timestamp-wrapper"><span class="timestamp">&lt;2025-10-16 Thu 23:59&gt;</span></span>.</li>
<li><code>PSET5</code>: Finitely generated abelian groups (<code>pdf</code>)(<code>tex</code>) <span class="timestamp-wrapper"><span class="timestamp">&lt;2025-11-06 Thu 23:59&gt;</span></span>.</li>
<li><code>PSET6</code>: Symmetries of regular polyhedra (<code>pdf</code>)(<code>tex</code>) <span class="timestamp-wrapper"><span class="timestamp">&lt;2025-11-18 Tue 23:59&gt;</span></span>.</li>
<li><code>PSET7</code>: Group actions (<code>pdf</code>)(<code>tex</code>) <span class="timestamp-wrapper"><span class="timestamp">&lt;2025-12-09 Tue 23:59&gt;</span></span>.</li>
</ul>
</div>
</div>

<div id="outline-container-org8af2129" class="outline-3">
<h3 id="org8af2129">Exams (<code>300 points</code>)</h3>
<div class="outline-text-3" id="text-org8af2129">
<p>
There will be three midterm exams. Each exam will have 5 questions. Each question will
be worth <code>20 points</code>.
</p>
<ul class="org-ul">
<li><code>EXAM1</code>: Lectures 1-7. <span class="timestamp-wrapper"><span class="timestamp">&lt;2025-09-25 Thu&gt;</span></span></li>
<li><code>EXAM2</code>: Lectures 8-14. <span class="timestamp-wrapper"><span class="timestamp">&lt;2025-11-06 Thu&gt;</span></span></li>
<li><code>EXAM3</code>: Lectures 18-22. <span class="timestamp-wrapper"><span class="timestamp">&lt;2025-12-09 Tue&gt;</span></span></li>
</ul>
<p>
Question one will ask you to define a concept. Question two will ask you to
prove a result (of reasonable difficulty) from the assigned reading. Questions
3, 4, and 5 will be random problems related to the topics of the lectures.
</p>
</div>
</div>
<div id="outline-container-orge1b1f97" class="outline-3">
<h3 id="orge1b1f97">``Mistakes were made'' essay (<code>100 points</code>)</h3>
<div class="outline-text-3" id="text-orge1b1f97">
<p>
This is a <b>handwritten</b> essay, due on the day of the final exam. It must
include at least:
</p>
<ul class="org-ul">
<li>three <span class="underline">mathematical</span> mistakes you (the <b>student</b>) made during the course
(either in a homework assignment, a previous test, or during self-study), and</li>
<li>two mathematical mistakes your favorite AI made when prompted with some group
theory question;</li>
</ul>

<p>
along with thorough explanations of the nature of the errors and their
corrections. The essay will be graded on the mathematical accuracy of each
explanation: an accurate description of each mistake, together with a complete
correction, will be worth <code>20 points</code>.
</p>
</div>
</div>

<div id="outline-container-orgf16ab12" class="outline-3">
<h3 id="orgf16ab12">Final exam (<code>300 points</code>)</h3>
<div class="outline-text-3" id="text-orgf16ab12">
<p>
The final exam will consist on six random problems related to the topics of the
lectures. Each problem will be worth <code>50 points</code>. The emphasis will be on the
topics of lectures 1-14 and 18-22. 
</p>
</div>
</div>

<div id="outline-container-orgfa02e48" class="outline-3">
<h3 id="orgfa02e48">Grades</h3>
<div class="outline-text-3" id="text-orgfa02e48">
<p>
The perfect final grade is <code>1000 points</code>. The alphabetical grade of the class
will be calculated as follows:
</p>
<ul class="org-ul">
<li><code>Homework grade = min(300, PSET1 + ... + PSET7)</code>.</li>
<li><code>Exams grade = EXAM1 + EXAM2 + EXAM3 + ESSAY + FINAL</code></li>
<li><code>Final grade = Homework grade + Exams grade</code>.</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Grade</b></th>
<th scope="col" class="org-left">A</th>
<th scope="col" class="org-left">A\(-\)</th>
<th scope="col" class="org-left">B\(+\)</th>
<th scope="col" class="org-left">B</th>
<th scope="col" class="org-left">B\(-\)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>points</code></td>
<td class="org-left">\([860,1000]\)</td>
<td class="org-left">\([830,860)\)</td>
<td class="org-left">\([780,830)\)</td>
<td class="org-left">\([740,780)\)</td>
<td class="org-left">\([690,740)\)</td>
</tr>
</tbody>
</table>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>Grade</b></th>
<th scope="col" class="org-left">C\(+\)</th>
<th scope="col" class="org-left">C</th>
<th scope="col" class="org-left">C\(-\)</th>
<th scope="col" class="org-left">D\(+\)</th>
<th scope="col" class="org-left">D</th>
<th scope="col" class="org-left">F</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>points</code></td>
<td class="org-left">\([650,690)\)</td>
<td class="org-left">\([610,650)\)</td>
<td class="org-left">\([560,610)\)</td>
<td class="org-left">\([520,560)\)</td>
<td class="org-left">\([480,520)\)</td>
<td class="org-left">\([0,480)\)</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
