teaching/411-fall-25/411-fall-25.org
* Topics and schedule
It is the student's responsibility to read the material before the lecture.
During the lectures, we will focus on reviewing the key concepts, answering
questions, and working on examples.


|------------------+---------------------------------------+------------------|
| Date             | Lecture                               |          Reading |
|------------------+---------------------------------------+------------------|
| /                | <                                     |                < |
| <2025-09-02 Tue> | 1. [[https://www.dropbox.com/scl/fi/p1wxilymw0vyhqvnk3z0a/Lecture-1.pdf?rlkey=wz6pvevnvakryws6uz4t8jsgx&st=oihmxpsu&dl=0][What is symmetry?]]                  | 1.1 - 1.7, [[https://kconrad.math.uconn.edu/blurbs/grouptheory/whygroups.pdf][Blurb]] |
| <2025-09-04 Thu> | 2. [[https://www.dropbox.com/scl/fi/ye5ewjg4w53js9i9nnlqp/Lecture-2.pdf?rlkey=en0vp8k0mxcdldak8rpebqe5w&st=q1vmzgj1&dl=0][Examples of groups]]                 |        1.1 - 1.7 |
| <2025-09-09 Tue> | 3. [[https://www.dropbox.com/scl/fi/5fn0wkb6ejtsk79mqsjpc/Lecture-3.pdf?rlkey=2v43ltzmasna2gk3lyqmmoulk&dl=0][Abstract groups: first results]]     |        1.10, 2.1 |
| <2025-09-11 Thu> | 4. [[https://www.dropbox.com/scl/fi/17ji5counqyvroky0zxh7/Lecture-4.pdf?rlkey=ihh68st77av0gy3322151n05e&dl=0][Subgroups and cyclic groups]]        |              2.2 |
| <2025-09-16 Tue> | 5. [[https://www.dropbox.com/scl/fi/utckf9w72zu37yaec6f8c/Lecture-5.pdf?rlkey=fe58spmzyrto2y4xmrhr1lbh3&dl=0][Dihedral groups]]                    |              2.3 |
| <2025-09-18 Thu> | 6. [[https://www.dropbox.com/scl/fi/c4bwzgfb771pt55lv5r7k/Lecture-6.pdf?rlkey=66e9htb7zs3mo0avx0w6bcezy&dl=0][Homomorphisms and isomorphisms]]     |              2.4 |
| <2025-09-23 Tue> | 7. [[https://www.dropbox.com/scl/fi/4z4br5snua92kfmkyyqha/Lecture-7.pdf?rlkey=red8npkhxxxf51qcykp1rudpy&dl=0][The sign of a permutation]]          |            [[https://kconrad.math.uconn.edu/blurbs/grouptheory/sign.pdf][Blurb]] |
| <2025-09-25 Thu> | *Exam 1*                              |                  |
| <2025-09-30 Tue> | 8. [[https://www.dropbox.com/scl/fi/c49t3qqjya7v7pc29tazj/Lecture-8.pdf?rlkey=5qmji57c31u5npkxthnpqr0ya&dl=0][Cosets]]                             |              2.5 |
| <2025-10-02 Thu> | 9. [[https://www.dropbox.com/scl/fi/oxt143yka9abuh63wmpfd/Lecture-9.pdf?rlkey=iw757fm7u5t6e1jr5u2xlqy6h&dl=0][Lagrange's theorem]]                 |              2.5 |
| <2025-10-07 Tue> | 10. [[https://www.dropbox.com/scl/fi/5umx9xqjvzhxw28wvecpl/Lecture-10.pdf?rlkey=7o83fhinujrhqwrodnnmg0mco&dl=0][Noether's isomorphism theorems]]    |              2.7 |
| <2025-10-09 Thu> | 11. [[https://www.dropbox.com/scl/fi/yogahfmerlrevbc65y30r/Lecture-11.pdf?rlkey=w71u05arfw3kzyqiehc1ufx7d&dl=0][Direct products]]                   |              3.1 |
| <2025-10-14 Tue> | 12. [[https://www.dropbox.com/scl/fi/zekcw3zkkquwxs1zs8rlm/Lecture-12.pdf?rlkey=ooh7llneiqrcpf6reai4xdqc8&dl=0][Semidirect products]]               |              3.2 |
| <2025-10-16 Thu> | 13. Linear algebra over the integers  |              3.5 |
| <2025-10-21 Tue> | 14. Finitely generated abelian groups |              3.6 |
| <2025-10-23 Thu> | 15. Rotations of regular polyhedra    |              4.1 |
| <2025-10-28 Tue> | 16. The Dodecahedron and Icosahedron  |              4.2 |
| <2025-10-30 Thu> | 17. Reflections                       |              4.3 |
| <2025-11-04 Tue> | *No class* (election day)             |                  |
| <2025-11-06 Thu> | *Exam 2*                              |                  |
| <2025-11-11 Tue> | *No class* (veterans day)             |                  |
| <2025-11-13 Thu> | 18. Group actions                     |              5.1 |
| <2025-11-18 Tue> | 19. Counting orbits                   |              5.2 |
| <2025-11-20 Thu> | 20. Symmetries of groups              |              5.3 |
| <2025-11-25 Tue> | 21. Group actions and group structure |              5.4 |
| <2025-11-27 Thu> | *No class* (thanksgiving)             |                  |
| <2025-12-02 Tue> | 22. The Sylow theorems                |            [[https://kconrad.math.uconn.edu/blurbs/grouptheory/sylowpf.pdf][Blurb]] |
| <2025-12-04 Thu> | 23. Questions?                        |                  |
| <2025-12-09 Tue> | *Exam 3*                              |                  |
|------------------+---------------------------------------+------------------|

* Philosophy
** Adopt a growth mindset
  Your effort and attitude determine your abilities. Embrace challenges and
  failure as an oportunity to grow. Find inspiration in other people's success.
** Learning is the student's responsibility
Paraphrasing Galileo:
#+BEGIN_QUOTE
``You cannot teach a person *anything*; you can only help
them find it within themselves.''
#+END_QUOTE
We are all here to _understand_. My job as a more experienced learner is to
assist you on your journey. But you are responsible for investing the time and
effort necessary to learn.
** Doing hard things
This is hard work, and it will be frustrating at times. In my opinion, the
reward is well worth the investment, as it is often the case with challenging
endeavors. In the words of JFK:
#+BEGIN_QUOTE
``We choose to go to the Moon in this decade and do the other things, not
because they are easy, but because they are hard; because that goal will serve
to organize and measure the best of our energies and skills, because that
challenge is one that we are willing to accept, one we are unwilling to
postpone, and one we intend to win, and the others, too.''
#+END_QUOTE

