teaching/411-fall-25/411-fall-25.html

<div id="outline-container-org7dcee22" class="outline-2">
<h2 id="org7dcee22">Topics and schedule</h2>
<div class="outline-text-2" id="text-org7dcee22">
<p>
It is the student's responsibility to read the material before the lecture.
During the lectures, we will focus on reviewing the key concepts, answering
questions, and working on examples.
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-left">Lecture</th>
<th scope="col" class="org-right">Reading</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-09-02 Tue&gt;</span></span></td>
<td class="org-left">1. <a href="https://www.dropbox.com/scl/fi/p1wxilymw0vyhqvnk3z0a/Lecture-1.pdf?rlkey=wz6pvevnvakryws6uz4t8jsgx&amp;st=oihmxpsu&amp;dl=0">What is symmetry?</a></td>
<td class="org-right">1.1 - 1.7, <a href="https://kconrad.math.uconn.edu/blurbs/grouptheory/whygroups.pdf">Blurb</a></td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-09-04 Thu&gt;</span></span></td>
<td class="org-left">2. <a href="https://www.dropbox.com/scl/fi/ye5ewjg4w53js9i9nnlqp/Lecture-2.pdf?rlkey=en0vp8k0mxcdldak8rpebqe5w&amp;st=q1vmzgj1&amp;dl=0">Examples of groups</a></td>
<td class="org-right">1.1 - 1.7</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-09-09 Tue&gt;</span></span></td>
<td class="org-left">3. <a href="https://www.dropbox.com/scl/fi/5fn0wkb6ejtsk79mqsjpc/Lecture-3.pdf?rlkey=2v43ltzmasna2gk3lyqmmoulk&amp;dl=0">Abstract groups: first results</a></td>
<td class="org-right">1.10, 2.1</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-09-11 Thu&gt;</span></span></td>
<td class="org-left">4. <a href="https://www.dropbox.com/scl/fi/17ji5counqyvroky0zxh7/Lecture-4.pdf?rlkey=ihh68st77av0gy3322151n05e&amp;dl=0">Subgroups and cyclic groups</a></td>
<td class="org-right">2.2</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-09-16 Tue&gt;</span></span></td>
<td class="org-left">5. <a href="https://www.dropbox.com/scl/fi/utckf9w72zu37yaec6f8c/Lecture-5.pdf?rlkey=fe58spmzyrto2y4xmrhr1lbh3&amp;dl=0">Dihedral groups</a></td>
<td class="org-right">2.3</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-09-18 Thu&gt;</span></span></td>
<td class="org-left">6. Homomorphisms and isomorphisms</td>
<td class="org-right">2.4</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-09-23 Tue&gt;</span></span></td>
<td class="org-left">7. The sign of a permutation</td>
<td class="org-right"><a href="https://kconrad.math.uconn.edu/blurbs/grouptheory/sign.pdf">Blurb</a></td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-09-25 Thu&gt;</span></span></td>
<td class="org-left"><b>Exam 1</b></td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-09-30 Tue&gt;</span></span></td>
<td class="org-left">8. Cosets</td>
<td class="org-right">2.5</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-10-02 Thu&gt;</span></span></td>
<td class="org-left">9. Lagrange's theorem</td>
<td class="org-right">2.5</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-10-07 Tue&gt;</span></span></td>
<td class="org-left">10. <a href="https://en.wikipedia.org/wiki/Emmy_Noether">Noether's</a> isomorphism theorems</td>
<td class="org-right">2.7</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-10-09 Thu&gt;</span></span></td>
<td class="org-left">11. Direct products</td>
<td class="org-right">3.1</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-10-14 Tue&gt;</span></span></td>
<td class="org-left">12. Semidirect products</td>
<td class="org-right">3.2</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-10-16 Thu&gt;</span></span></td>
<td class="org-left">13. Linear algebra over the integers</td>
<td class="org-right">3.5</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-10-21 Tue&gt;</span></span></td>
<td class="org-left">14. Finitely generated abelian groups</td>
<td class="org-right">3.6</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-10-23 Thu&gt;</span></span></td>
<td class="org-left">15. Rotations of regular polyhedra</td>
<td class="org-right">4.1</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-10-28 Tue&gt;</span></span></td>
<td class="org-left">16. The Dodecahedron and Icosahedron</td>
<td class="org-right">4.2</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-10-30 Thu&gt;</span></span></td>
<td class="org-left">17. Reflections</td>
<td class="org-right">4.3</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-11-04 Tue&gt;</span></span></td>
<td class="org-left"><b>No class</b> (election day)</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-11-06 Thu&gt;</span></span></td>
<td class="org-left"><b>Exam 2</b></td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-11-11 Tue&gt;</span></span></td>
<td class="org-left"><b>No class</b> (veterans day)</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-11-13 Thu&gt;</span></span></td>
<td class="org-left">18. Group actions</td>
<td class="org-right">5.1</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-11-18 Tue&gt;</span></span></td>
<td class="org-left">19. Counting orbits</td>
<td class="org-right">5.2</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-11-20 Thu&gt;</span></span></td>
<td class="org-left">20. Symmetries of groups</td>
<td class="org-right">5.3</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-11-25 Tue&gt;</span></span></td>
<td class="org-left">21. Group actions and group structure</td>
<td class="org-right">5.4</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-11-27 Thu&gt;</span></span></td>
<td class="org-left"><b>No class</b> (thanksgiving)</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-12-02 Tue&gt;</span></span></td>
<td class="org-left">22. The Sylow theorems</td>
<td class="org-right"><a href="https://kconrad.math.uconn.edu/blurbs/grouptheory/sylowpf.pdf">Blurb</a></td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-12-04 Thu&gt;</span></span></td>
<td class="org-left">23. Questions?</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2025-12-09 Tue&gt;</span></span></td>
<td class="org-left"><b>Exam 3</b></td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orga4876dc" class="outline-2">
<h2 id="orga4876dc">Philosophy</h2>
<div class="outline-text-2" id="text-orga4876dc">
</div>
<div id="outline-container-orgb087619" class="outline-3">
<h3 id="orgb087619">Adopt a growth mindset</h3>
<div class="outline-text-3" id="text-orgb087619">
<p>
Your effort and attitude determine your abilities. Embrace challenges and
failure as an oportunity to grow. Find inspiration in other people's success.
</p>
</div>
</div>
<div id="outline-container-org3570d4c" class="outline-3">
<h3 id="org3570d4c">Learning is the student's responsibility</h3>
<div class="outline-text-3" id="text-org3570d4c">
<p>
Paraphrasing Galileo:
</p>
<blockquote>
<p>
``You cannot teach a person <b>anything</b>; you can only help
them find it within themselves.''
</p>
</blockquote>
<p>
We are all here to <span class="underline">understand</span>. My job as a more experienced learner is to
assist you on your journey. But you are responsible for investing the time and
effort necessary to learn.
</p>
</div>
</div>
<div id="outline-container-org2183785" class="outline-3">
<h3 id="org2183785">Doing hard things</h3>
<div class="outline-text-3" id="text-org2183785">
<p>
This is hard work, and it will be frustrating at times. In my opinion, the
reward is well worth the investment, as it is often the case with challenging
endeavors. In the words of JFK:
</p>
<blockquote>
<p>
``We choose to go to the Moon in this decade and do the other things, not
because they are easy, but because they are hard; because that goal will serve
to organize and measure the best of our energies and skills, because that
challenge is one that we are willing to accept, one we are unwilling to
postpone, and one we intend to win, and the others, too.''
</p>
</blockquote>
</div>
</div>
