teaching/411-fall-25/411-fall-25.org
** Everyone belongs in this classroom
We will subscribe to [[https://www.ams.org/publications/journals/notices/201610/rnoti-p1164.pdf][Federico's axioms]].

+ *Axiom 1.* Mathematical potential is equally present in different groups,
  irrespective of geographic, demographic, and economic boundaries.

+ *Axiom 2.* Everyone can have joyful, meaningful, and empowering mathematical
  experiences.

+ *Axiom 3.* Mathematics is a powerful, malleable tool that can be shaped and
  used differently by various communities to serve their needs.

+ *Axiom 4.* Every student deserves to be treated with dignity and respect.

* Administrative details
- Add/drop only through SPIRE.
- I do not keep a waiting list, and the mathematics department staff will not
  handle these matters.
- Final exams are kept by the mathematics department. Copies are available upon
  request.
** Drops, withdrawals, and incompletes
- Last day to add or drop with no record: <2025-09-08 Mon>.
- Last day to drop with W: <2025-10-28 Tue>.
- See the [[https://www.umass.edu/registrar/academic-calendar][academic calendar]] for other important dates.
- Incomplete grades are warranted only if a student is passing the course at the
  time of the request and if the course requirements can be completed by the
  end of the following semester. Read more [[https://www.umass.edu/natural-sciences/advising/petitions-and-forms/incomplete-grade-form][here]].

** Make-up exam policy
You must take the regular exam unless you qualify for an official make-up exam
approved by me, following the official make-up request procedure. Make sure you
read and understand the make-up exam procedure.

+ *Final exam conflict:* If you need a make-up exam due to a final exam
  schedule conflict, you must submit documentation from the Registrar's Office
  or other supporting documents at least two weeks before the scheduled exams.
  No exceptions will be made. No later than one week before the exam, you must
  submit a written request to me that includes: your name and UMass Amherst
  Student ID number, your section number, and the reason for requesting the
  make-up exam. You can request make-up exams through your SPIRE account: in
  SPIRE, go to Student Home > Final Exam Conflict.

+ *Religious observance:* If you must miss an exam due to religious observance,
  you must contact me within two weeks of the beginning of the semester.

+ *Medical reasons:* If you will be absent from an exam due to medical reasons,
  you must notify me at least one week in advance of the exam. If you have a
  medical emergency, you must notify me as soon as possible. In either case,
  you may need to provide documentation. You do not need to disclose personal
  details of your condition, but you must provide enough information to allow
  the absence to be excused.

+ *Other circumstances:* It is impossible to anticipate all possible
  situations. In the event of an exceptional circumstance not covered above,
  you must contact me and explain the problem. You must be prepared to provide
  a written statement if necessary. I will evaluate the reasons you provide and
  make a decision.

+ Note that there is *no re-taking of exams* in this course. If you are sick
  and take the exam anyway, you cannot re-take the exam later for a better
  grade. Regardless of the situation, if you do not feel you can take the exam
  on the scheduled date, you must inform me as soon as possible.
  
+ Make-up exams will *not* be given to accommodate travel plans.

+ I will ensure that taking a make-up exam does not represent any technical
  advantage. In particular, the questions will be completely different from
  those on the main exam.


** Class attendance policy
By UMass policy, students are expected to attend all regularly scheduled
classes at the University for which they are registered. When planning for the
tests and homework, I will assume that you have been following my lectures.
That being said, I will not enforce or grade for attendance. If you are not
able to attend to one of the lectures, make sure you read the notes for that
day and talk to other students to check if you missed anything important.

** Class etiquette
- I expect you to be present and refrain from using your phone.
- Arrive on time. If you arrive late, try to minimize your disruption.
- Laptops and tablets are allowed during the lectures, provided that you do not
  disrupt your fellow classmates and the lectures.

** Academic dishonesty 

Academic dishonesty includes but is not limited to: 
- *Cheating:* intentional use, and/or attempted use of trickery, artifice,
  deception, breach of confidence, fraud and/or misrepresentation of one's
  academic work.
- *Fabrication:* intentional and unauthorized falsification and/or invention of
  any information or citation in any academic exercise.
- *Plagiarism:* knowingly representing the words or ideas of another as one's
  own work in any academic exercise. This includes submitting without citation,
  in whole or in part, prewritten term papers of another or the research of
  another, including but not limited to commercial vendors who sell or
  distribute such materials.
- *Facilitating dishonesty:* knowingly helping or attempting to help another
  commit an act of academic dishonesty, including substituting for another in
  an examination, or allowing others to represent as their own one's papers,
  reports, or academic works.

Formal definitions of academic dishonesty, examples of various forms of
dishonesty, and the procedures which faculty must follow to penalize dishonesty
are detailed on the [[https://www.umass.edu/studentsuccess/academic-integrity][Academic Honesty website]]. Appeals must be filed within ten
days of notification by the Academic Honesty Office that a formal charge has
been filed by an instructor that suspects dishonesty. Contact the Academic
Honesty Office for more information on the process. The [[https://www.umass.edu/ombuds/][Ombuds Office]] is also
available to support individuals engaging with the Academic Honesty process.
The [[https://www.umass.edu/provost/][Provost’s Office]] is where appeals are processed and filed.

* Required statements
