teaching/411-fall-25/411-fall-25.html

<div id="outline-container-org6beea2a" class="outline-3">
<h3 id="org6beea2a">Everyone belongs in this classroom</h3>
<div class="outline-text-3" id="text-org6beea2a">
<p>
We will subscribe to <a href="https://www.ams.org/publications/journals/notices/201610/rnoti-p1164.pdf">Federico's axioms</a>.
</p>

<ul class="org-ul">
<li><b>Axiom 1.</b> Mathematical potential is equally present in different groups,
irrespective of geographic, demographic, and economic boundaries.</li>

<li><b>Axiom 2.</b> Everyone can have joyful, meaningful, and empowering mathematical
experiences.</li>

<li><b>Axiom 3.</b> Mathematics is a powerful, malleable tool that can be shaped and
used differently by various communities to serve their needs.</li>

<li><b>Axiom 4.</b> Every student deserves to be treated with dignity and respect.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org4b06956" class="outline-2">
<h2 id="org4b06956">Administrative details</h2>
<div class="outline-text-2" id="text-org4b06956">
<ul class="org-ul">
<li>Add/drop only through SPIRE.</li>
<li>I do not keep a waiting list, and the mathematics department staff will not
handle these matters.</li>
<li>Final exams are kept by the mathematics department. Copies are available upon
request.</li>
</ul>
</div>
<div id="outline-container-org4053da6" class="outline-3">
<h3 id="org4053da6">Drops, withdrawals, and incompletes</h3>
<div class="outline-text-3" id="text-org4053da6">
<ul class="org-ul">
<li>Last day to add or drop with no record: <span class="timestamp-wrapper"><span class="timestamp">&lt;2025-09-08 Mon&gt;</span></span>.</li>
<li>Last day to drop with W: <span class="timestamp-wrapper"><span class="timestamp">&lt;2025-10-28 Tue&gt;</span></span>.</li>
<li>See the <a href="https://www.umass.edu/registrar/academic-calendar">academic calendar</a> for other important dates.</li>
<li>Incomplete grades are warranted only if a student is passing the course at the
time of the request and if the course requirements can be completed by the
end of the following semester. Read more <a href="https://www.umass.edu/natural-sciences/advising/petitions-and-forms/incomplete-grade-form">here</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-orgff336b8" class="outline-3">
<h3 id="orgff336b8">Make-up exam policy</h3>
<div class="outline-text-3" id="text-orgff336b8">
<p>
You must take the regular exam unless you qualify for an official make-up exam
approved by me, following the official make-up request procedure. Make sure you
read and understand the make-up exam procedure.
</p>

<ul class="org-ul">
<li><b>Final exam conflict:</b> If you need a make-up exam due to a final exam
schedule conflict, you must submit documentation from the Registrar's Office
or other supporting documents at least two weeks before the scheduled exams.
No exceptions will be made. No later than one week before the exam, you must
submit a written request to me that includes: your name and UMass Amherst
Student ID number, your section number, and the reason for requesting the
make-up exam. You can request make-up exams through your SPIRE account: in
SPIRE, go to Student Home &gt; Final Exam Conflict.</li>

<li><b>Religious observance:</b> If you must miss an exam due to religious observance,
you must contact me within two weeks of the beginning of the semester.</li>

<li><b>Medical reasons:</b> If you will be absent from an exam due to medical reasons,
you must notify me at least one week in advance of the exam. If you have a
medical emergency, you must notify me as soon as possible. In either case,
you may need to provide documentation. You do not need to disclose personal
details of your condition, but you must provide enough information to allow
the absence to be excused.</li>

<li><b>Other circumstances:</b> It is impossible to anticipate all possible
situations. In the event of an exceptional circumstance not covered above,
you must contact me and explain the problem. You must be prepared to provide
a written statement if necessary. I will evaluate the reasons you provide and
make a decision.</li>

<li>Note that there is <b>no re-taking of exams</b> in this course. If you are sick
and take the exam anyway, you cannot re-take the exam later for a better
grade. Regardless of the situation, if you do not feel you can take the exam
on the scheduled date, you must inform me as soon as possible.</li>

<li>Make-up exams will <b>not</b> be given to accommodate travel plans.</li>

<li>I will ensure that taking a make-up exam does not represent any technical
advantage. In particular, the questions will be completely different from
those on the main exam.</li>
</ul>
</div>
</div>


<div id="outline-container-orgbf26865" class="outline-3">
<h3 id="orgbf26865">Class attendance policy</h3>
<div class="outline-text-3" id="text-orgbf26865">
<p>
By UMass policy, students are expected to attend all regularly scheduled
classes at the University for which they are registered. When planning for the
tests and homework, I will assume that you have been following my lectures.
That being said, I will not enforce or grade for attendance. If you are not
able to attend to one of the lectures, make sure you read the notes for that
day and talk to other students to check if you missed anything important.
</p>
</div>
</div>

<div id="outline-container-org8ee18d8" class="outline-3">
<h3 id="org8ee18d8">Class etiquette</h3>
<div class="outline-text-3" id="text-org8ee18d8">
<ul class="org-ul">
<li>I expect you to be present and refrain from using your phone.</li>
<li>Arrive on time. If you arrive late, try to minimize your disruption.</li>
<li>Laptops and tablets are allowed during the lectures, provided that you do not
disrupt your fellow classmates and the lectures.</li>
</ul>
</div>
</div>

<div id="outline-container-org6e4d589" class="outline-3">
<h3 id="org6e4d589">Academic dishonesty</h3>
<div class="outline-text-3" id="text-org6e4d589">
<p>
Academic dishonesty includes but is not limited to: 
</p>
<ul class="org-ul">
<li><b>Cheating:</b> intentional use, and/or attempted use of trickery, artifice,
deception, breach of confidence, fraud and/or misrepresentation of one's
academic work.</li>
<li><b>Fabrication:</b> intentional and unauthorized falsification and/or invention of
any information or citation in any academic exercise.</li>
<li><b>Plagiarism:</b> knowingly representing the words or ideas of another as one's
own work in any academic exercise. This includes submitting without citation,
in whole or in part, prewritten term papers of another or the research of
another, including but not limited to commercial vendors who sell or
distribute such materials.</li>
<li><b>Facilitating dishonesty:</b> knowingly helping or attempting to help another
commit an act of academic dishonesty, including substituting for another in
an examination, or allowing others to represent as their own one's papers,
reports, or academic works.</li>
</ul>

<p>
Formal definitions of academic dishonesty, examples of various forms of
dishonesty, and the procedures which faculty must follow to penalize dishonesty
are detailed on the <a href="https://www.umass.edu/studentsuccess/academic-integrity">Academic Honesty website</a>. Appeals must be filed within ten
days of notification by the Academic Honesty Office that a formal charge has
been filed by an instructor that suspects dishonesty. Contact the Academic
Honesty Office for more information on the process. The <a href="https://www.umass.edu/ombuds/">Ombuds Office</a> is also
available to support individuals engaging with the Academic Honesty process.
The <a href="https://www.umass.edu/provost/">Provost’s Office</a> is where appeals are processed and filed.
</p>
</div>
</div>
</div>

<div id="outline-container-org764f2e9" class="outline-2">
<h2 id="org764f2e9">Required statements</h2>
<div class="outline-text-2" id="text-org764f2e9">
</div>
