teaching/411-fall-25/411-fall-25.html
<div id="outline-container-org1827532" class="outline-3">
<h3 id="org1827532">Academic honesty statement</h3>
<div class="outline-text-3" id="text-org1827532">
<p>
Since the integrity of the academic enterprise of any institution of higher
education requires honesty in scholarship and research, academic honesty is
required of all students at the University of Massachusetts Amherst. Academic
dishonesty is prohibited in all programs of the University. Academic dishonesty
includes but is not limited to: cheating, fabrication, plagiarism, and
facilitating dishonesty. Appropriate sanctions may be imposed on any student
who has committed an act of academic dishonesty. Instructors should take
reasonable steps to address academic misconduct. Any person who has reason to
believe that a student has committed academic dishonesty should bring such
information to the attention of the appropriate course instructor as soon as
possible. Instances of academic dishonesty not related to a specific course
should be brought to the attention of the appropriate department Head or Chair.
Since students are expected to be familiar with this policy and the commonly
accepted standards of academic integrity, ignorance of such standards is not
normally sufficient evidence of lack of intent
(<a href="http://www.umass.edu/dean_students/codeofconduct/acadhonesty/">http://www.umass.edu/dean_students/codeofconduct/acadhonesty/</a>).
</p>
</div>
</div>

<div id="outline-container-org097d4e1" class="outline-3">
<h3 id="org097d4e1">Academic integrity statement</h3>
<div class="outline-text-3" id="text-org097d4e1">
<p>
UMass Amherst is strongly committed to academic integrity, which is defined as
completing all academic work without cheating, lying, stealing, or receiving
unauthorized assistance from any other person, or using any source of
information not appropriately authorized or attributed. As a community, we hold
each other accountable and support each other’s knowledge and understanding of
academic integrity. Academic dishonesty is prohibited in all programs of the
University and includes but is not limited to: Cheating, fabrication,
plagiarism, lying, and facilitating dishonesty, via analogue and digital means.
Sanctions may be imposed on any student who has committed or participated in an
academic integrity infraction. Any person who has reason to believe that a
student has committed an academic integrity infraction should bring such
information to the attention of the appropriate course instructor as soon as
possible. All students at the University of Massachusetts Amherst have read and
acknowledged the Commitment to Academic Integrity and are knowingly responsible
for completing all work with integrity and in accordance with the policy:
(<a href="https://www.umass.edu/senate/book/academic-regulations-academic-integrity-policy">https://www.umass.edu/senate/book/academic-regulations-academic-integrity-policy</a>).
</p>
</div>
</div>

<div id="outline-container-orgd33c204" class="outline-3">
<h3 id="orgd33c204">Accommodation statement</h3>
<div class="outline-text-3" id="text-orgd33c204">
<p>
The University of Massachusetts Amherst is committed to providing an equal
educational opportunity for all students. If you have a documented physical,
psychological, or learning disability on file with Disability Services (DS),
you may be eligible for reasonable academic accommodations to help you succeed
in this course. If you have a documented disability that requires an
accommodation, please notify me within the first two weeks of the semester so
that we may make appropriate arrangements. For further information, please
visit Disability Services (<a href="https://www.umass.edu/disability/">https://www.umass.edu/disability/</a>).
</p>
</div>
</div>

<div id="outline-container-orgc74e168" class="outline-3">
<h3 id="orgc74e168">Title IX statement</h3>
<div class="outline-text-3" id="text-orgc74e168">
<p>
In accordance with Title IX of the Education Amendments of 1972 that prohibits
gender-based discrimination in educational settings that receive federal funds,
the University of Massachusetts Amherst is committed to providing a safe
learning environment for all students, free from all forms of discrimination,
including sexual assault, sexual harassment, domestic violence, dating
violence, stalking, and retaliation. This includes interactions in person or
online through digital platforms and social media. Title IX also protects
against discrimination on the basis of pregnancy, childbirth, false pregnancy,
miscarriage, abortion, or related conditions, including recovery. There are
resources here on campus to support you. A summary of the available Title IX
resources (confidential and non-confidential) can be found at the following
link: <a href="https://www.umass.edu/titleix/resources">https://www.umass.edu/titleix/resources</a>. You do not need to make a formal
report to access them. If you need immediate support, you are not alone. Free
and confidential support is available 24 hours a day / 7 days a week / 365 days
a year at the SASA Hotline 413-545-0800.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Santiago Arango-Piñeros</p>
<p class="date">Created: 2025-09-16 Tue 08:24</p>
</div>
</body>
</html>
